Tekla Open API Reference for Tekla Structures 2025
Seam.UpVector Property
 A vector indicating which direction is considered the up direction for the seam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector UpVector { get; set; }
Public Property UpVector As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
Seam Class
Tekla.Structures.Model Namespace